БПКР/src/Documents/МодернизацияОС/МодернизацияОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>МодернизацияОС</name>
  <registerRecords>InformationRegister.СведенияОбИмуществе</registerRecords>
  <registerRecords>AccumulationRegister.ДвижениеОСНУ</registerRecords>
  <registerRecords>InformationRegister.СведенияОТранспорте</registerRecords>
  <registerRecords>InformationRegister.ПараметрыУчетаОС</registerRecords>
  <registerRecords>InformationRegister.СобытияОС</registerRecords>
  <registerRecords>AccumulationRegister.КорректировкиНУ</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаМодернизации</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьМодернизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АмортизацияЗаМесяц</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОстаточнаяСтоимостьОС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьПослеМодернизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НакопленнаяАмортизация</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазаАмортизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Событие</name>
    <type>
      <types>EnumRef.ВидыСобытийОС</types>
    </type>
  </attributes>
  <attributes>
    <name>АмортизацияЗаМесяцПослеМодернизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазаАмортизацииПослеМодернизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОстаточнаяСтоимостьОСПослеМодернизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НакопленнаяАмортизацияПослеМодернизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеВключатьАмортизациюЗаМесяц</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПараметрыОС</name>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>EnumRef.ПараметрыМодернизацииОС</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>EnumRef.СпособыНачисленияАмортизацииОС</types>
        <types>CatalogRef.КодыИмущества</types>
        <types>CatalogRef.СпособыОтраженияРасходовПоАмортизации</types>
        <types>Boolean</types>
        <types>CatalogRef.ПараметрыВыработкиОС</types>
        <types>CatalogRef.ГруппыНалоговогоУчетаОС</types>
        <types>CatalogRef.РегиональныеКоэффициентыНалогНаИмущество</types>
        <types>CatalogRef.ОтраслевыеКоэффициентыНалогНаИмущество</types>
        <types>CatalogRef.ЗональныеКоэффициенты</types>
        <types>String</types>
        <types>Number</types>
        <types>EnumRef.ПараметрыМодернизацииОС</types>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
        <types>CatalogRef.ГруппыИмущества</types>
        <types>CatalogRef.ВидыМатериаловСтенНалогНаИмущество</types>
        <types>CatalogRef.КодыПользователейИмущества</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтароеЗначение</name>
      <type>
        <types>EnumRef.СпособыНачисленияАмортизацииОС</types>
        <types>CatalogRef.КодыИмущества</types>
        <types>CatalogRef.СпособыОтраженияРасходовПоАмортизации</types>
        <types>Boolean</types>
        <types>CatalogRef.ПараметрыВыработкиОС</types>
        <types>CatalogRef.ГруппыНалоговогоУчетаОС</types>
        <types>CatalogRef.РегиональныеКоэффициентыНалогНаИмущество</types>
        <types>CatalogRef.ОтраслевыеКоэффициентыНалогНаИмущество</types>
        <types>CatalogRef.ЗональныеКоэффициенты</types>
        <types>String</types>
        <types>Number</types>
        <types>EnumRef.ПараметрыМодернизацииОС</types>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
        <types>CatalogRef.ГруппыИмущества</types>
        <types>CatalogRef.ВидыМатериаловСтенНалогНаИмущество</types>
        <types>CatalogRef.КодыПользователейИмущества</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БПКР/src/InformationRegisters/ПараметрыУчетаОС/ПараметрыУчетаОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыУчетаОС</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>ГруппаНУ</name>
    <type>
      <types>CatalogRef.ГруппыНалоговогоУчетаОС</types>
    </type>
  </resources>
  <resources>
    <name>ПервоначальнаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЛиквидационнаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокСлужбы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СпособНачисленияАмортизации</name>
    <type>
      <types>EnumRef.СпособыНачисленияАмортизацииОС</types>
    </type>
  </resources>
  <resources>
    <name>СпособОтраженияРасходовПоАмортизации</name>
    <type>
      <types>CatalogRef.СпособыОтраженияРасходовПоАмортизации</types>
    </type>
  </resources>
  <resources>
    <name>ПараметрВыработки</name>
    <type>
      <types>CatalogRef.ПараметрыВыработкиОС</types>
    </type>
  </resources>
  <resources>
    <name>ОбъемПродукции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоэффициентУскорения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СпособПоступления</name>
    <type>
      <types>EnumRef.СпособыПоступленияАктивов</types>
    </type>
  </resources>
  <resources>
    <name>ДатаВводаВЭксплуатацию</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьДляРасчетаАмортизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаНачисленияНалогаНаИмущество</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Консервация</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БПКР/src/AccountingRegisters/Хозрасчетный/Хозрасчетный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Хозрасчетный</name>
  <chartOfAccounts>ChartOfAccounts.Хозрасчетный</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</extDimensionAccountingFlag>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КорректироватьНУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

БПКР/src/InformationRegisters/СведенияОбИмуществе/СведенияОбИмуществе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СведенияОбИмуществе</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ГруппаИмущества</name>
    <type>
      <types>CatalogRef.ГруппыИмущества</types>
    </type>
  </resources>
  <resources>
    <name>ДатаВводаВЭксплуатацию</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>МатериалСтен</name>
    <type>
      <types>CatalogRef.ВидыМатериаловСтенНалогНаИмущество</types>
    </type>
  </resources>
  <resources>
    <name>ЖилаяПлощадь</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НежилаяПлощадь</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РегиональныйКоэффициент</name>
    <type>
      <types>CatalogRef.РегиональныеКоэффициентыНалогНаИмущество</types>
    </type>
  </resources>
  <resources>
    <name>ЗональныйКоэффициент</name>
    <type>
      <types>CatalogRef.ЗональныеКоэффициенты</types>
    </type>
  </resources>
  <resources>
    <name>ОтраслевойКоэффициент</name>
    <type>
      <types>CatalogRef.ОтраслевыеКоэффициентыНалогНаИмущество</types>
    </type>
  </resources>
  <resources>
    <name>КодИмущества</name>
    <type>
      <types>CatalogRef.КодыИмущества</types>
    </type>
  </resources>
  <resources>
    <name>КатегорияОбъектаИмущества</name>
    <type>
      <types>CatalogRef.КатегорияОбъектаИмущества</types>
    </type>
  </resources>
  <resources>
    <name>КодНазначенияИмущества</name>
    <type>
      <types>CatalogRef.ОтраслевыеКоэффициентыНалогНаИмущество</types>
    </type>
  </resources>
  <resources>
    <name>КодПользователяИмущества</name>
    <type>
      <types>CatalogRef.КодыПользователейИмущества</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БПКР/src/InformationRegisters/СостоянияОС/СостоянияОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияОС</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.ВидыСостоянийОС</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БПКР/src/Enums/СпособыНачисленияАмортизацииОС/СпособыНачисленияАмортизацииОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыНачисленияАмортизацииОС</name>
  <enumValues>
    <name>Линейный</name>
  </enumValues>
  <enumValues>
    <name>Производственный</name>
    <comment>Пропорционально объему продукции (работ)</comment>
  </enumValues>
  <enumValues>
    <name>ПоСуммеЧиселЛет</name>
  </enumValues>
  <enumValues>
    <name>УменьшаемогоОстатка</name>
  </enumValues>
  <enumValues>
    <name>НеНачислять</name>
  </enumValues>
</mdclass:Enum>

БПКР/src/Documents/МодернизацияОС/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

// Процедура - обработчик события ПриСозданииНаСервере.
// В процедуре осуществляется
// - инициализация реквизитов формы,
// - установка параметров функциональных опций формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Установка реквизитов формы.
	ДатаДокумента = Объект.Дата;
	
	ДанныеУчетнойПолитики = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьДанныеУчетнойПолитикиОрганизаций(ДатаДокумента, Объект.Организация);
	ВычетНАПриМодернизации = Константы.ВычетНАПриМодернизации.Получить();
	
	СоздатьПараметрыУчетаОС();	
	
	АмортизацияЗаМесяц = "Заполнение не предусмотрено";
	
	Если ЗначениеЗаполнено(Объект.ОсновноеСредство) Тогда
		ЗаполнитьПараметрыУчетаОС();
	КонецЕсли;

	БухгалтерскийУчетКлиентСервер.УстановитьКартинкуДляКомментария(Элементы.СтраницаДополнительно, Объект.Комментарий);
	
	// Установить видимость и доступность элементов формы
	УстановитьВидимостьДоступностьЭлементов();
	
	// РаботаСФормами
	РаботаСФормамиСервер.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец РаботаСФормами
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

// Процедура - обработчик события ПриЧтенииНаСервере.
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменений
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменений
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом 
	
КонецПроцедуры

// Процедура - обработчик события ПриОткрытии.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьПараметрыВыбораПараметраОС();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

// Процедура - обработчик события ПослеЗаписиНаСервере.
//
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)	
	
	// РаботаСФормами
	РаботаСФормамиСервер.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец РаботаСФормами
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.КонтрольВеденияУчета
	КонтрольВеденияУчета.ПослеЗаписиНаСервере(ТекущийОбъект);
	// Конец СтандартныеПодсистемы.КонтрольВеденияУчета
	
КонецПроцедуры

// Процедура - обработчик события ПослеЗаписи.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

// Процедура - обработчик события ОбработкаВыбора.
//
&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Объект.ПараметрыОС.Очистить();
	
	ЗаполнитьПараметрыВыбораПараметраОС();
	
	Для Каждого СтрокаСписка Из Элементы.ПараметрыПараметр.СписокВыбора Цикл
		СтрокаТабличнойЧасти = Объект.ПараметрыОС.Добавить();
		
		СтрокаТабличнойЧасти.Параметр = СтрокаСписка.Значение;
		
		Если ЗначениеЗаполнено(Объект.ОсновноеСредство) Тогда
			УстановитьТипПараметраВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти);	
			ЗаполнитьСтароеЗначение(СтрокаТабличнойЧасти);
			РасчетЛиквидационнойСтоимости(СтрокаТабличнойЧасти);
		КонецЕсли;
	КонецЦикла;
	
	Объект.ОсновноеСредство = ВыбранноеЗначение;
	
	Если ЗначениеЗаполнено(Объект.ОсновноеСредство) Тогда
		ЗаполнитьПараметрыУчетаОС();
	
		Для Каждого СтрокаТабличнойЧасти Из Объект.ПараметрыОС Цикл 
			ЗаполнитьСтароеЗначение(СтрокаТабличнойЧасти);
			
			Если СтрокаТабличнойЧасти.Параметр = ПредопределенноеЗначение("Перечисление.ПараметрыМодернизацииОС.СчетУчета") 
				И ЗначениеЗаполнено(СтрокаТабличнойЧасти.Значение) Тогда
				ПодставитьСчетУчетаМодернизации(СтрокаТабличнойЧасти.Значение);	
			КонецЕсли;	
		КонецЦикла;
		
		Если ЗначениеЗаполнено(Объект.ОсновноеСредство) Тогда
			РасчетАмортизацииИОстаточнойСтоимости();
		Иначе
			Для Каждого СтрокаТабличнойЧасти Из Объект.ПараметрыОС Цикл
				СтрокаТабличнойЧасти.Значение = Неопределено;
				СтрокаТабличнойЧасти.СтароеЗначение = Неопределено;
			КонецЦикла;	
		КонецЕсли;		
	КонецЕсли;
	
	УдаляемыеСтроки = Новый Массив;
	
	Для Каждого СтрокаТабличнойЧасти Из Объект.ПараметрыОС Цикл 
			
	 	Если НЕ ПараметрыУчетаОС.СпособНачисленияАмортизации = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.Производственный") Тогда		
			
			Если СтрокаТабличнойЧасти.Параметр = ПредопределенноеЗначение("Перечисление.ПараметрыМодернизацииОС.ПараметрыВыработки")
				ИЛИ СтрокаТабличнойЧасти.Параметр = ПредопределенноеЗначение("Перечисление.ПараметрыМодернизацииОС.ОбъемПродукции") Тогда
				УдаляемыеСТроки.Добавить(СтрокаТабличнойЧасти);
			КонецЕсли;
		КонецЕсли;	
			
		Если НЕ ПараметрыУчетаОС.СпособНачисленияАмортизации = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.УменьшаемогоОстатка") Тогда   
			
			Если СтрокаТабличнойЧасти.Параметр = ПредопределенноеЗначение("Перечисление.ПараметрыМодернизацииОС.КоэффициентУскорения") Тогда
				УдаляемыеСТроки.Добавить(СтрокаТабличнойЧасти);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого УдаляемаяСтрока ИЗ УдаляемыеСтроки Цикл
		
		Объект.ПараметрыОС.Удалить(УдаляемаяСтрока);	
		
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Процедура - обработчик события ПриИзменении поля ввода Дата.
// В процедуре определяется ситуация, когда при изменении своей даты документ 
// оказывается в другом периоде нумерации документов, и в этом случае
// присваивает документу новый уникальный номер.
// Переопределяет соответствующий параметр формы.
//
&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	// Обработка события изменения даты.
	ДатаПередИзменением = ДатаДокумента;
	ДатаДокумента = Объект.Дата;
	Если Объект.Дата <> ДатаПередИзменением Тогда
		СтруктураДанные = ПолучитьДанныеДатаПриИзменении(ДатаПередИзменением);
		Если СтруктураДанные.РазностьДат <> 0 Тогда
			Объект.Номер = "";
		КонецЕсли;
	КонецЕсли;
	
	БухгалтерскийУчетВызовСервераПовтИсп.УчетнаяПолитикаСуществует(Объект.Организация, ДатаДокумента, Истина, Объект.Ссылка);
	ДанныеУчетнойПолитики = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьДанныеУчетнойПолитикиОрганизаций(ДатаДокумента, Объект.Организация);
	
	Если ЗначениеЗаполнено(Объект.ОсновноеСредство) Тогда
		ЗаполнитьПараметрыУчетаОС();
		
		Для Каждого СтрокаТабличнойЧасти Из Объект.ПараметрыОС Цикл 
			ЗаполнитьСтароеЗначение(СтрокаТабличнойЧасти);
		КонецЦикла;
		
		РасчетАмортизацииИОстаточнойСтоимости();
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода Организация.
//
&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	// Обработка события изменения организации.
	Объект.Номер = "";
	БухгалтерскийУчетВызовСервераПовтИсп.УчетнаяПолитикаСуществует(Объект.Организация, ДатаДокумента, Истина, Объект.Ссылка);
	ДанныеУчетнойПолитики = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьДанныеУчетнойПолитикиОрганизаций(ДатаДокумента, Объект.Организация);
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода Комментарий.
//
&НаКлиенте
Процедура КомментарийПриИзменении(Элемент)
	ПодключитьОбработчикОжидания("УстановитьПиктограммуКомментария", 0.1, Истина);
КонецПроцедуры

// Процедура - обработчик события НачалоВыбора поля ввода Комментарий.
//
&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
КонецПроцедуры

// Процедура - обработчик события НачалоВыбора поля ввода ОсновноеСредство.
//
&НаКлиенте
Процедура ОсновноеСредствоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Отборы = Новый Структура;
	Отборы.Вставить("Организация", Объект.Организация);
	Отборы.Вставить("Непринятые", Ложь);
	Отборы.Вставить("ДатаПримененияОтбора", Объект.Дата);
	Отборы.Вставить("Состояние", ПредопределенноеЗначение("Перечисление.ВидыСостоянийОС.ПринятоКУчету"));
	
	ОткрытьФорму("Справочник.ОсновныеСредства.Форма.ФормаВыбора", Новый Структура("Отбор", Отборы), ЭтаФорма);
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода ОсновноеСредство.
//
&НаКлиенте
Процедура ОсновноеСредствоПриИзменении(Элемент)
	ЗаполнитьПараметрыУчетаОС();
	
	Для Каждого СтрокаТабличнойЧасти Из Объект.ПараметрыОС Цикл 
		ЗаполнитьСтароеЗначение(СтрокаТабличнойЧасти);
		
		Если СтрокаТабличнойЧасти.Параметр = ПредопределенноеЗначение("Перечисление.ПараметрыМодернизацииОС.СчетУчета") 
			И ЗначениеЗаполнено(СтрокаТабличнойЧасти.Значение) Тогда
			ПодставитьСчетУчетаМодернизации(СтрокаТабличнойЧасти.Значение);	
		КонецЕсли;	
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Объект.ОсновноеСредство) Тогда
		РасчетАмортизацииИОстаточнойСтоимости();
	Иначе
		Для Каждого СтрокаТабличнойЧасти Из Объект.ПараметрыОС Цикл
			СтрокаТабличнойЧасти.Значение = Неопределено;
			СтрокаТабличнойЧасти.СтароеЗначение = Неопределено;
		КонецЦикла;	
	КонецЕсли; 

КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода Параметры.
//
&НаКлиенте
Процедура ПараметрыПриИзменении(Элемент)
	РасчетАмортизацииИОстаточнойСтоимости();
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода Событие.
//
&НаКлиенте
Процедура СобытиеПриИзменении(Элемент)
	Объект.ПараметрыОС.Очистить();
	
	ЗаполнитьПараметрыВыбораПараметраОС();
	
	Для Каждого СтрокаСписка Из Элементы.ПараметрыПараметр.СписокВыбора Цикл
		СтрокаТабличнойЧасти = Объект.ПараметрыОС.Добавить();
		
		СтрокаТабличнойЧасти.Параметр = СтрокаСписка.Значение;
		
		Если ЗначениеЗаполнено(Объект.ОсновноеСредство) Тогда
			УстановитьТипПараметраВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти);	
			ЗаполнитьСтароеЗначение(СтрокаТабличнойЧасти);
			РасчетЛиквидационнойСтоимости(СтрокаТабличнойЧасти);
		КонецЕсли;
	КонецЦикла;
	
	Если Объект.Событие = ПредопределенноеЗначение("Перечисление.ВидыСобытийОС.ИзменениеПараметров") Тогда 
		Объект.СтоимостьМодернизации = 0;
	КонецЕсли;	
	
	УдаляемыеСтроки = Новый Массив;
	
	Для Каждого СтрокаТабличнойЧасти Из Объект.ПараметрыОС Цикл 
			
	 	Если НЕ ПараметрыУчетаОС.СпособНачисленияАмортизации = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.Производственный") Тогда		
			
			Если СтрокаТабличнойЧасти.Параметр = ПредопределенноеЗначение("Перечисление.ПараметрыМодернизацииОС.ПараметрыВыработки")
				ИЛИ СтрокаТабличнойЧасти.Параметр = ПредопределенноеЗначение("Перечисление.ПараметрыМодернизацииОС.ОбъемПродукции") Тогда
				УдаляемыеСТроки.Добавить(СтрокаТабличнойЧасти);
			КонецЕсли;
		КонецЕсли;	
			
		Если НЕ ПараметрыУчетаОС.СпособНачисленияАмортизации = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.УменьшаемогоОстатка") Тогда   
			
			Если СтрокаТабличнойЧасти.Параметр = ПредопределенноеЗначение("Перечисление.ПараметрыМодернизацииОС.КоэффициентУскорения") Тогда
				УдаляемыеСТроки.Добавить(СтрокаТабличнойЧасти);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого УдаляемаяСтрока ИЗ УдаляемыеСтроки Цикл
		
		Объект.ПараметрыОС.Удалить(УдаляемаяСтрока);	
		
	КонецЦикла;
	
	// Установить видимость и доступность элементов формы
	УстановитьВидимостьДоступностьЭлементов();
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода СтоимостьМодернизации.
//
&НаКлиенте
Процедура СтоимостьМодернизацииПриИзменении(Элемент)
	Объект.СтоимостьПослеМодернизации = ПервоначальнаяСтоимость + Объект.СтоимостьМодернизации;
	РасчетАмортизацииИОстаточнойСтоимости();
КонецПроцедуры

&НаКлиенте
Процедура НеВключатьАмортизациюЗаМесяцПриИзменении(Элемент)
	Объект.СтоимостьПослеМодернизации = ПервоначальнаяСтоимость + Объект.СтоимостьМодернизации;
	РасчетАмортизацииИОстаточнойСтоимости();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПараметрыОС

&НаКлиенте
Процедура ПараметрыОСПриАктивизацииСтроки(Элемент)
	// Получаем текущую строку
	СтрокаТабличнойЧасти = Элементы.ПараметрыОС.ТекущиеДанные;
	
	// Не удалось получить- возвращаемся
	Если СтрокаТабличнойЧасти = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	УстановитьТипПараметраВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти);
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода ОСПараметр.
//
&НаКлиенте
Процедура ОСПараметрПриИзменении(Элемент)
	// Получаем текущую строку
	СтрокаТабличнойЧасти = Элементы.ПараметрыОС.ТекущиеДанные;
	
	// Не удалось получить- возвращаемся
	Если СтрокаТабличнойЧасти = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	УстановитьТипПараметраВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти);	
	ЗаполнитьСтароеЗначение(СтрокаТабличнойЧасти);
	РасчетЛиквидационнойСтоимости(СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыЗначениеПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ПараметрыОС.ТекущиеДанные;
		
	Если ТекущаяСтрока <> Неопределено Тогда
		
		Если Объект.Событие = ПредопределенноеЗначение("Перечисление.ВидыСобытийОС.ИзменениеПараметров") Тогда
				
			Если ТекущаяСтрока.Параметр = ПредопределенноеЗначение("Перечисление.ПараметрыМодернизацииОС.ЛиквидационнаяСтоимость") Тогда
				
				Если ТекущаяСтрока.Значение <> ТекущаяСтрока.СтароеЗначение Тогда
					Объект.БазаАмортизацииПослеМодернизации = ?(ВычетНАПриМодернизации,
						ПервоначальнаяСтоимость - ТекущаяСтрока.Значение - Объект.НакопленнаяАмортизацияПослеМодернизации,
						ПервоначальнаяСтоимость - ТекущаяСтрока.Значение);																		
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;		
						
		Если ТекущаяСтрока.Параметр = ПредопределенноеЗначение("Перечисление.ПараметрыМодернизацииОС.СпособНачисленияАмортизации") Тогда
			
			// Добавление недостающих строк
			ЗаполнитьПараметрыВыбораПараметраОС();

			Для Каждого СтрокаСписка Из Элементы.ПараметрыПараметр.СписокВыбора Цикл
				
				Если Объект.ПараметрыОС.НайтиСтроки(Новый Структура("Параметр", СтрокаСписка.Значение)).Количество() > 0 Тогда
					Продолжить;	     		
				КонецЕсли;	
				
				СтрокаТабличнойЧасти = Объект.ПараметрыОС.Добавить();
				
				СтрокаТабличнойЧасти.Параметр = СтрокаСписка.Значение;
				
				Если ЗначениеЗаполнено(Объект.ОсновноеСредство) Тогда	
					ЗаполнитьСтароеЗначение(СтрокаТабличнойЧасти);
				КонецЕсли;
			КонецЦикла;
			
			// Удаление лишних
			УдаляемыеСтроки = Новый Массив;

			Для Каждого СтрокаТабличнойЧасти Из Объект.ПараметрыОС Цикл 
					
			 	Если НЕ ТекущаяСтрока.Значение = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.Производственный") Тогда		
					
					Если СтрокаТабличнойЧасти.Параметр = ПредопределенноеЗначение("Перечисление.ПараметрыМодернизацииОС.ПараметрыВыработки")
						ИЛИ СтрокаТабличнойЧасти.Параметр = ПредопределенноеЗначение("Перечисление.ПараметрыМодернизацииОС.ОбъемПродукции") Тогда
						УдаляемыеСТроки.Добавить(СтрокаТабличнойЧасти);
					КонецЕсли;
				КонецЕсли;	
					
				Если НЕ ТекущаяСтрока.Значение = ПредопределенноеЗначение("Перечисление.СпособыНачисленияАмортизацииОС.УменьшаемогоОстатка") Тогда   
					
					Если СтрокаТабличнойЧасти.Параметр = ПредопределенноеЗначение("Перечисление.ПараметрыМодернизацииОС.КоэффициентУскорения") Тогда
						УдаляемыеСТроки.Добавить(СтрокаТабличнойЧасти);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
			Для Каждого УдаляемаяСтрока ИЗ УдаляемыеСтроки Цикл

				Объект.ПараметрыОС.Удалить(УдаляемаяСтрока);	
				
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РассчитатьСуммы(Команда)
	
	Отказ = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Объект.ОсновноеСредство) Тогда
		ТекстСообщения = НСтр("ru = 'Не заполнено Основное средство. Расчет документа отменено.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "Объект.ОсновноеСредство",,Отказ)		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.СчетУчетаМодернизации) Тогда
		ТекстСообщения = НСтр("ru = 'Не заполнен Счет учета модернизации. Расчет документа отменено.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "Объект.СчетУчетаМодернизации",,Отказ)		
	КонецЕсли;
	
	Если Отказ Тогда 
		Возврат
	КонецЕсли;	
	
	Если Объект.ПараметрыОС.Количество() > 0 Тогда 
		ОписаниеОповещения = Новый ОписаниеОповещения("ОтветНаВопросРассчитатьСтоимостьМодернизации", ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'Стоимость модернизации будет перерасчитана. Продолжить выполнение операции?'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 60);
	Иначе
		ЗаполнитьПараметрыУчетаОС();
		Для Каждого СтрокаТабличнойЧасти Из Объект.ПараметрыОС Цикл 
			ЗаполнитьСтароеЗначение(СтрокаТабличнойЧасти);
		КонецЦикла;
		
		РасчетАмортизацииИОстаточнойСтоимости();
		РассчитатьСтоимостьМодернизации();
	КонецЕсли;
КонецПроцедуры      

#КонецОбласти

#Область ОбработчикиРезультатовИнтерактивныхДействий

&НаКлиенте
Процедура ОтветНаВопросРассчитатьСтоимостьМодернизации(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗаполнитьПараметрыУчетаОС();
		Для Каждого СтрокаТабличнойЧасти Из Объект.ПараметрыОС Цикл 
			ЗаполнитьСтароеЗначение(СтрокаТабличнойЧасти);
		КонецЦикла;
		
		РасчетАмортизацииИОстаточнойСтоимости();
		РассчитатьСтоимостьМодернизации();
	КонецЕсли; 
КонецПроцедуры	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура устанавливает видимость и доступность элементов.
//
&НаСервере
Процедура УстановитьВидимостьДоступностьЭлементов()

	Если Объект.Событие = Перечисления.ВидыСобытийОС.Модернизация Тогда 
		Элементы.СчетУчетаМодернизации.Видимость 			= Истина;
		Элементы.СтоимостьМодернизации.Видимость 			= Истина;
		Элементы.ГруппаСтоимость.Видимость 					= Истина;
		Элементы.ГруппаАмортизацияЗаМесяц.Видимость 		= Истина;
		Элементы.ГруппаОстаточнаяСтоимость.Видимость 		= Истина;
		Элементы.ГруппаБазаАмортизации.Видимость 			= Истина;
		Элементы.ГруппаНакопленнаяАмортизация.Видимость		= Истина;
		Элементы.РассчитатьСтоимостьМодернизации.Видимость 	= Истина;
		Элементы.СтоимостьПослеМодернизации.Видимость		= Истина;
	Иначе 
		Элементы.СчетУчетаМодернизации.Видимость 			= НЕ ДанныеУчетнойПолитики.НачислениеАмортизацииОСПоМесяцам;
		Элементы.СтоимостьМодернизации.Видимость 			= Ложь;
		Элементы.ГруппаСтоимость.Видимость 					= НЕ ДанныеУчетнойПолитики.НачислениеАмортизацииОСПоМесяцам;
		Элементы.ГруппаАмортизацияЗаМесяц.Видимость 		= НЕ ДанныеУчетнойПолитики.НачислениеАмортизацииОСПоМесяцам;
		Элементы.ГруппаОстаточнаяСтоимость.Видимость 		= НЕ ДанныеУчетнойПолитики.НачислениеАмортизацииОСПоМесяцам;
		Элементы.ГруппаБазаАмортизации.Видимость 			= НЕ ДанныеУчетнойПолитики.НачислениеАмортизацииОСПоМесяцам;
		Элементы.ГруппаНакопленнаяАмортизация.Видимость		= НЕ ДанныеУчетнойПолитики.НачислениеАмортизацииОСПоМесяцам;
		Элементы.РассчитатьСтоимостьМодернизации.Видимость 	= Ложь;
		Элементы.СтоимостьПослеМодернизации.Видимость		= Ложь;
	КонецЕсли;	
	
	Элементы.АмортизацияЗаМесяц.Заголовок = ?(ДанныеУчетнойПолитики.НачислениеАмортизацииОСПоМесяцам, 
												НСтр("ru = 'Амортизация за месяц'"), НСтр("ru = 'Амортизация по дату'"));
												
	Элементы.АмортизацияЗаМесяц.Видимость = Не ДанныеУчетнойПолитики.НачислениеАмортизацииОСПоМесяцам; 
	Элементы.АмортизацияЗаМесяцНеПредусмотрено.Видимость = ДанныеУчетнойПолитики.НачислениеАмортизацииОСПоМесяцам;
	Элементы.АмортизацияЗаМесяцПослеМодернизации.Видимость = ДанныеУчетнойПолитики.НачислениеАмортизацииОСПоМесяцам;
	Элементы.АмортизацияЗаМесяцПослеМодернизацииНеПредусмотрено.Видимость = Не ДанныеУчетнойПолитики.НачислениеАмортизацииОСПоМесяцам;
	
КонецПроцедуры

// Получает набор данных с сервера для процедуры ДатаПриИзменении.
//
&НаСервере
Функция ПолучитьДанныеДатаПриИзменении(ДатаПередИзменением)
	РазностьДат = БухгалтерскийУчетСервер.ПроверитьНомерДокумента(Объект.Ссылка, Объект.Дата, ДатаПередИзменением);
	
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("РазностьДат",	РазностьДат);
	
	Возврат СтруктураДанные;
КонецФункции // ПолучитьДанныеДатаПриИзменении()

// Процедура - Установить пиктограмму комментария.
//
&НаКлиенте
Процедура УстановитьПиктограммуКомментария()
	БухгалтерскийУчетКлиентСервер.УстановитьКартинкуДляКомментария(Элементы.СтраницаДополнительно, Объект.Комментарий);
КонецПроцедуры

// Процедура - Создать параметры учета ОС
//
&НаСервере
Процедура СоздатьПараметрыУчетаОС()

	ПараметрыУчетаОС = Новый Структура();
	ПараметрыУчетаОС.Вставить("ИнвентарныйНомер", "");
	ПараметрыУчетаОС.Вставить("НакопленныйИзнос", "");
	ПараметрыУчетаОС.Вставить("ПервоначальнаяСтоимость", "");
	ПараметрыУчетаОС.Вставить("СрокСлужбы", "");
	ПараметрыУчетаОС.Вставить("ГруппаНУ", "");
	ПараметрыУчетаОС.Вставить("ОбъемПродукции", "");
	ПараметрыУчетаОС.Вставить("СпособОтраженияРасходовПоАмортизации", "");
	ПараметрыУчетаОС.Вставить("СпособНачисленияАмортизации", "");
	ПараметрыУчетаОС.Вставить("СчетУчета", "");
	ПараметрыУчетаОС.Вставить("ЛиквидационнаяСтоимость", "");
	ПараметрыУчетаОС.Вставить("МатериалСтен", "");
	ПараметрыУчетаОС.Вставить("ЖилаяПлощадь", "");
	ПараметрыУчетаОС.Вставить("НежилаяПлощадь", "");
	ПараметрыУчетаОС.Вставить("РегиональныйКоэффициент", "");
	ПараметрыУчетаОС.Вставить("ЗональныйКоэффициент", "");
	ПараметрыУчетаОС.Вставить("ОтраслевойКоэффициент", "");
	ПараметрыУчетаОС.Вставить("КодИмущества", "");
	ПараметрыУчетаОС.Вставить("ГруппаИмущества", "");
	ПараметрыУчетаОС.Вставить("КодНазначенияИмущества", "");
	ПараметрыУчетаОС.Вставить("КодПользователяИмущества", "");
	ПараметрыУчетаОС.Вставить("Консервация", "");
	ПараметрыУчетаОС.Вставить("ПараметрыВыработки", "");
	ПараметрыУчетаОС.Вставить("КоэффициентУскорения", "");

КонецПроцедуры // СоздатьПараметрыУчетаОС()

// Процедура - Заполнить параметры учета ОС
//
&НаСервере
Процедура ЗаполнитьПараметрыУчетаОС()
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ПараметрыУчетаОССрезПоследних.ИнвентарныйНомер,
		|	ПараметрыУчетаОССрезПоследних.ПервоначальнаяСтоимость,
		|	ПараметрыУчетаОССрезПоследних.СрокСлужбы КАК СрокСлужбы,
		|	ПараметрыУчетаОССрезПоследних.ОбъемПродукции,
		|	ПараметрыУчетаОССрезПоследних.СпособОтраженияРасходовПоАмортизации,
		|	ПараметрыУчетаОССрезПоследних.СчетУчета,
		|	ПараметрыУчетаОССрезПоследних.ЛиквидационнаяСтоимость,
		|	ПараметрыУчетаОССрезПоследних.СпособНачисленияАмортизации,
		|	ПараметрыУчетаОССрезПоследних.ГруппаНУ,
		|	ПараметрыУчетаОССрезПоследних.Консервация,
		|	ПараметрыУчетаОССрезПоследних.ПараметрВыработки КАК ПараметрыВыработки,
		|	ПараметрыУчетаОССрезПоследних.ОбъемПродукции,
		|	ПараметрыУчетаОССрезПоследних.КоэффициентУскорения,
		|	ЕСТЬNULL(ХозрасчетныйОстатки.СуммаОстатокКт, 0) КАК НакопленныйИзнос,
		|	СведенияОбИмуществеСрезПоследних.МатериалСтен,
		|	СведенияОбИмуществеСрезПоследних.ЖилаяПлощадь,
		|	СведенияОбИмуществеСрезПоследних.НежилаяПлощадь,
		|	СведенияОбИмуществеСрезПоследних.РегиональныйКоэффициент,
		|	СведенияОбИмуществеСрезПоследних.ЗональныйКоэффициент,
		|	СведенияОбИмуществеСрезПоследних.ОтраслевойКоэффициент,
		|	СведенияОбИмуществеСрезПоследних.КодИмущества,
		|	СведенияОбИмуществеСрезПоследних.КодНазначенияИмущества,
		|	СведенияОбИмуществеСрезПоследних.КодПользователяИмущества,
		|	СведенияОбИмуществеСрезПоследних.ГруппаИмущества
		|ИЗ
		|	РегистрСведений.ПараметрыУчетаОС.СрезПоследних(&Период, ОсновноеСредство = &ОсновноеСредство) КАК ПараметрыУчетаОССрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Остатки(&Период, , ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства), Субконто1 = &ОсновноеСредство) КАК ХозрасчетныйОстатки
		|		ПО ПараметрыУчетаОССрезПоследних.ОсновноеСредство = ХозрасчетныйОстатки.Субконто1
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОбИмуществе.СрезПоследних(&Период, ОсновноеСредство = &ОсновноеСредство) КАК СведенияОбИмуществеСрезПоследних
		|		ПО ПараметрыУчетаОССрезПоследних.ОсновноеСредство = СведенияОбИмуществеСрезПоследних.ОсновноеСредство
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияОС.СрезПоследних(&Период, Состояние = ЗНАЧЕНИЕ(Перечисление.ВидыСостоянийОС.ПринятоКУчету)) КАК СостоянияОССрезПоследних
		|		ПО ПараметрыУчетаОССрезПоследних.ОсновноеСредство = СостоянияОССрезПоследних.ОсновноеСредство";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Период", ДатаДокумента - 1);
	Запрос.УстановитьПараметр("ОсновноеСредство", Объект.ОсновноеСредство);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	ЗаполнитьЗначенияСвойств(ПараметрыУчетаОС, Выборка);
	ПервоначальнаяСтоимость = Выборка.ПервоначальнаяСтоимость;
КонецПроцедуры // ЗаполнитьПараметрыУчетаОС()

// Процедура - Рассчитать стоимость модернизации
//
&НаСервере
Процедура РассчитатьСтоимостьМодернизации()	

	ЛиквидационнаяСтоимость = ПараметрыУчетаОС.ЛиквидационнаяСтоимость;
	ПараметрыОтбора = Новый Структура("Параметр", Перечисления.ПараметрыМодернизацииОС.ЛиквидационнаяСтоимость);
	Массив = Объект.ПараметрыОС.НайтиСтроки(ПараметрыОтбора);
	Если Массив.Количество() > 0 Тогда
		ЛиквидационнаяСтоимость = Массив[0].Значение;	
	КонецЕсли;	
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ХозрасчетныйОстатки.СуммаОстаток, 0) КАК СуммаОстаток
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(
		|			&Период,
		|			Счет = &Счет,
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства),
		|			Организация = &Организация
		|				И Субконто1 = &ОсновноеСредство) КАК ХозрасчетныйОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПараметрыУчетаОССрезПоследних.СтоимостьДляРасчетаАмортизации КАК СтоимостьДляРасчетаАмортизации
		|ИЗ
		|	РегистрСведений.ПараметрыУчетаОС.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И ОсновноеСредство = &ОсновноеСредство
		|				И Регистратор <> &Ссылка) КАК ПараметрыУчетаОССрезПоследних";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("Период", ДатаДокумента);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Счет", Объект.СчетУчетаМодернизации);
	Запрос.УстановитьПараметр("ОсновноеСредство", Объект.ОсновноеСредство);
		
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ВыборкаХозрасчетный = МассивРезультатов[0].Выбрать();	
	ВыборкаХозрасчетный.Следующий();
	Объект.СтоимостьМодернизации = ВыборкаХозрасчетный.СуммаОстаток;
	
	ВыборкаПараметрыУчета = МассивРезультатов[1].Выбрать();	
	ВыборкаПараметрыУчета.Следующий();
	Объект.БазаАмортизации = ВыборкаПараметрыУчета.СтоимостьДляРасчетаАмортизации;
	
	// Старый расчет
	Объект.СтоимостьПослеМодернизации = ПервоначальнаяСтоимость + Объект.СтоимостьМодернизации;
	//Если ДанныеУчетнойПолитики.НачислениеАмортизацииОСПоМесяцам Тогда
	//	Объект.ОстаточнаяСтоимостьОСПослеМодернизации = ПервоначальнаяСтоимость + Объект.СтоимостьМодернизации - Объект.НакопленнаяАмортизация;
	//Иначе	
	//	Объект.ОстаточнаяСтоимостьОСПослеМодернизации = ПервоначальнаяСтоимость - Объект.НакопленнаяАмортизацияПослеМодернизации;
	//КонецЕсли;
	//Объект.БазаАмортизацииПослеМодернизации = ?(ВычетНАПриМодернизации,
	//	Объект.СтоимостьПослеМодернизации - ЛиквидационнаяСтоимость - Объект.НакопленнаяАмортизацияПослеМодернизации,
	//	Объект.СтоимостьПослеМодернизации - ЛиквидационнаяСтоимость);
	
	//									
	ЛиквидационнаяСтоимость = ЗначениеЛиквидационнойСтоимости();
	Объект.ОстаточнаяСтоимостьОС = ПервоначальнаяСтоимость - Объект.НакопленнаяАмортизация;
	Если ДанныеУчетнойПолитики.НачислениеАмортизацииОСПоМесяцам Тогда
		Объект.НакопленнаяАмортизацияПослеМодернизации 	= Объект.НакопленнаяАмортизация + ?(Объект.НеВключатьАмортизациюЗаМесяц, 0, Объект.АмортизацияЗаМесяц);
		Объект.ОстаточнаяСтоимостьОСПослеМодернизации 	= ПервоначальнаяСтоимость + Объект.СтоимостьМодернизации - Объект.НакопленнаяАмортизацияПослеМодернизации; 
	Иначе	
		Объект.НакопленнаяАмортизацияПослеМодернизации 	= Объект.НакопленнаяАмортизация + ?(Объект.НеВключатьАмортизациюЗаМесяц, 0, Объект.АмортизацияЗаМесяц);
		Объект.ОстаточнаяСтоимостьОСПослеМодернизации 	= ПервоначальнаяСтоимость + Объект.СтоимостьМодернизации - Объект.НакопленнаяАмортизацияПослеМодернизации;
	КонецЕсли;	
			
	Объект.БазаАмортизацииПослеМодернизации = ?(ВычетНАПриМодернизации,
		ПервоначальнаяСтоимость + Объект.СтоимостьМодернизации - ЛиквидационнаяСтоимость - Объект.НакопленнаяАмортизацияПослеМодернизации,
		ПервоначальнаяСтоимость + Объект.СтоимостьМодернизации - ЛиквидационнаяСтоимость);	
	
КонецПроцедуры

// Процедура - Установить тип параметра в строке табличной части
//
// Параметры:
//  СтрокаТабличнойЧасти - СтрокаТабличнойЧасти - Строка табличной части
//
&НаКлиенте
Процедура УстановитьТипПараметраВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти)

	КвалификаторЧисла = Неопределено;
	
	Если СтрокаТабличнойЧасти.Параметр = ПредопределенноеЗначение("Перечисление.ПараметрыМодернизацииОС.СпособОтраженияРасходовПоАмортизации") Тогда
		ТипПоля = "СправочникСсылка.СпособыОтраженияРасходовПоАмортизации";	
	ИначеЕсли СтрокаТабличнойЧасти.Параметр = ПредопределенноеЗначение("Перечисление.ПараметрыМодернизацииОС.МатериалСтен") Тогда
		ТипПоля = "СправочникСсылка.ВидыМатериаловСтенНалогНаИмущество";
	ИначеЕсли СтрокаТабличнойЧасти.Параметр = ПредопределенноеЗначение("Перечисление.ПараметрыМодернизацииОС.РегиональныйКоэффициент") Тогда
		ТипПоля = "СправочникСсылка.РегиональныеКоэффициентыНалогНаИмущество";
	ИначеЕсли СтрокаТабличнойЧасти.Параметр = ПредопределенноеЗначение("Перечисление.ПараметрыМодернизацииОС.ЗональныйКоэффициент") Тогда
		ТипПоля = "СправочникСсылка.ЗональныеКоэффициенты";
	ИначеЕсли СтрокаТабличнойЧасти.Параметр = ПредопределенноеЗначение("Перечисление.ПараметрыМодернизацииОС.КодНазначенияИмущества") Тогда
		ТипПоля = "СправочникСсылка.ОтраслевыеКоэффициентыНалогНаИмущество";
	ИначеЕсли СтрокаТабличнойЧасти.Параметр = ПредопределенноеЗначение("Перечисление.ПараметрыМодернизацииОС.КодПользователяИмущества") Тогда
		ТипПоля = "СправочникСсылка.КодыПользователейИмущества";
	ИначеЕсли СтрокаТабличнойЧасти.Параметр = ПредопределенноеЗначение("Перечисление.ПараметрыМодернизацииОС.СчетУчета") Тогда
		ТипПоля = "ПланСчетовСсылка.Хозрасчетный";	
	ИначеЕсли СтрокаТабличнойЧасти.Параметр = ПредопределенноеЗначение("Перечисление.ПараметрыМодернизацииОС.ГруппаИмущества") Тогда
		ТипПоля = "СправочникСсылка.ГруппыИмущества";
	ИначеЕсли СтрокаТабличнойЧасти.Параметр = ПредопределенноеЗначение("Перечисление.ПараметрыМодернизацииОС.КодИмущества") Тогда
		ТипПоля = "СправочникСсылка.КодыИмущества";
	ИначеЕсли СтрокаТабличнойЧасти.Параметр = ПредопределенноеЗначение("Перечисление.ПараметрыМодернизацииОС.ГруппаНУ") Тогда
		ТипПоля = "СправочникСсылка.ГруппыНалоговогоУчетаОС";
	ИначеЕсли СтрокаТабличнойЧасти.Параметр = ПредопределенноеЗначение("Перечисление.ПараметрыМодернизацииОС.СпособНачисленияАмортизации") Тогда
		ТипПоля = "ПеречислениеСсылка.СпособыНачисленияАмортизацииОС";
	ИначеЕсли СтрокаТабличнойЧасти.Параметр = ПредопределенноеЗначение("Перечисление.ПараметрыМодернизацииОС.ИнвентарныйНомер") Тогда
		ТипПоля = "Строка";
	ИначеЕсли СтрокаТабличнойЧасти.Параметр = ПредопределенноеЗначение("Перечисление.ПараметрыМодернизацииОС.Консервация") Тогда
		ТипПоля = "Булево";
	ИначеЕсли СтрокаТабличнойЧасти.Параметр = ПредопределенноеЗначение("Перечисление.ПараметрыМодернизацииОС.ПараметрыВыработки") Тогда
		ТипПоля = "СправочникСсылка.ПараметрыВыработкиОС"; 
	ИначеЕсли СтрокаТабличнойЧасти.Параметр = ПредопределенноеЗначение("Перечисление.ПараметрыМодернизацииОС.ЛиквидационнаяСтоимость")
		ИЛИ СтрокаТабличнойЧасти.Параметр = ПредопределенноеЗначение("Перечисление.ПараметрыМодернизацииОС.ОбъемПродукции")
		ИЛИ СтрокаТабличнойЧасти.Параметр = ПредопределенноеЗначение("Перечисление.ПараметрыМодернизацииОС.КоэффициентУскорения") Тогда	
		ТипПоля = "Число";
		КвалификаторЧисла = Новый КвалификаторыЧисла(15,2); 
	Иначе
		ТипПоля = "Число";
	КонецЕсли;
	
	Если КвалификаторЧисла = Неопределено Тогда
		Элементы.ПараметрыЗначение.ОграничениеТипа = Новый ОписаниеТипов(ТипПоля); 
		Элементы.ПараметрыЗначение.ОграничениеТипа.ПривестиЗначение(ТипПоля); 
	Иначе	
		Элементы.ПараметрыЗначение.ОграничениеТипа = Новый ОписаниеТипов(ТипПоля,,,КвалификаторЧисла); 
		Элементы.ПараметрыЗначение.ОграничениеТипа.ПривестиЗначение(ТипПоля); 
	КонецЕсли;
КонецПроцедуры // УстановитьТипПоляСтрокиТабличнойЧасти()

// Процедура - Заполнить старое значение
//
// Параметры:
//  СтрокаТабличнойЧасти - СтрокаТабличнойЧасти - Строка табличной части
//
&НаКлиенте
Процедура ЗаполнитьСтароеЗначение(СтрокаТабличнойЧасти)
	Если СтрокаТабличнойЧасти.Параметр = ПредопределенноеЗначение("Перечисление.ПараметрыМодернизацииОС.ИнвентарныйНомер") Тогда
		СтрокаТабличнойЧасти.СтароеЗначение = ПараметрыУчетаОС.ИнвентарныйНомер;
	ИначеЕсли СтрокаТабличнойЧасти.Параметр = ПредопределенноеЗначение("Перечисление.ПараметрыМодернизацииОС.НакопленныйИзнос") Тогда
		СтрокаТабличнойЧасти.СтароеЗначение = ПараметрыУчетаОС.НакопленныйИзнос;
	ИначеЕсли СтрокаТабличнойЧасти.Параметр = ПредопределенноеЗначение("Перечисление.ПараметрыМодернизацииОС.СрокСлужбы") Тогда
		СтрокаТабличнойЧасти.СтароеЗначение = ПараметрыУчетаОС.СрокСлужбы;		
	ИначеЕсли СтрокаТабличнойЧасти.Параметр = ПредопределенноеЗначение("Перечисление.ПараметрыМодернизацииОС.СпособОтраженияРасходовПоАмортизации") Тогда
		СтрокаТабличнойЧасти.СтароеЗначение = ПараметрыУчетаОС.СпособОтраженияРасходовПоАмортизации;
	ИначеЕсли СтрокаТабличнойЧасти.Параметр = ПредопределенноеЗначение("Перечисление.ПараметрыМодернизацииОС.СчетУчета") Тогда
		СтрокаТабличнойЧасти.СтароеЗначение = ПараметрыУчетаОС.СчетУчета;
	ИначеЕсли СтрокаТабличнойЧасти.Параметр = ПредопределенноеЗначение("Перечисление.ПараметрыМодернизацииОС.ЛиквидационнаяСтоимость") Тогда
		СтрокаТабличнойЧасти.СтароеЗначение = ПараметрыУчетаОС.ЛиквидационнаяСтоимость;
	ИначеЕсли СтрокаТабличнойЧасти.Параметр = ПредопределенноеЗначение("Перечисление.ПараметрыМодернизацииОС.МатериалСтен") Тогда
		СтрокаТабличнойЧасти.СтароеЗначение = ПараметрыУчетаОС.МатериалСтен;
	ИначеЕсли СтрокаТабличнойЧасти.Параметр = ПредопределенноеЗначение("Перечисление.ПараметрыМодернизацииОС.ЖилаяПлощадь") Тогда
		СтрокаТабличнойЧасти.СтароеЗначение = ПараметрыУчетаОС.ЖилаяПлощадь;
	ИначеЕсли СтрокаТабличнойЧасти.Параметр = ПредопределенноеЗначение("Перечисление.ПараметрыМодернизацииОС.НежилаяПлощадь") Тогда
		СтрокаТабличнойЧасти.СтароеЗначение = ПараметрыУчетаОС.НежилаяПлощадь;
	ИначеЕсли СтрокаТабличнойЧасти.Параметр = ПредопределенноеЗначение("Перечисление.ПараметрыМодернизацииОС.РегиональныйКоэффициент") Тогда
		СтрокаТабличнойЧасти.СтароеЗначение = ПараметрыУчетаОС.РегиональныйКоэффициент;
	ИначеЕсли СтрокаТабличнойЧасти.Параметр = ПредопределенноеЗначение("Перечисление.ПараметрыМодернизацииОС.ЗональныйКоэффициент") Тогда
		СтрокаТабличнойЧасти.СтароеЗначение = ПараметрыУчетаОС.ЗональныйКоэффициент;
	ИначеЕсли СтрокаТабличнойЧасти.Параметр = ПредопределенноеЗначение("Перечисление.ПараметрыМодернизацииОС.ГруппаИмущества") Тогда
		СтрокаТабличнойЧасти.СтароеЗначение = ПараметрыУчетаОС.ГруппаИмущества;
	ИначеЕсли СтрокаТабличнойЧасти.Параметр = ПредопределенноеЗначение("Перечисление.ПараметрыМодернизацииОС.КодИмущества") Тогда
		СтрокаТабличнойЧасти.СтароеЗначение = ПараметрыУчетаОС.КодИмущества;
	ИначеЕсли СтрокаТабличнойЧасти.Параметр = ПредопределенноеЗначение("Перечисление.ПараметрыМодернизацииОС.КодНазначенияИмущества") Тогда
		СтрокаТабличнойЧасти.СтароеЗначение = ПараметрыУчетаОС.КодНазначенияИмущества;
	ИначеЕсли СтрокаТабличнойЧасти.Параметр = ПредопределенноеЗначение("Перечисление.ПараметрыМодернизацииОС.КодПользователяИмущества") Тогда
		СтрокаТабличнойЧасти.СтароеЗначение = ПараметрыУчетаОС.КодПользователяИмущества;
	ИначеЕсли СтрокаТабличнойЧасти.Параметр = ПредопределенноеЗначение("Перечисление.ПараметрыМодернизацииОС.СпособНачисленияАмортизации") Тогда
		СтрокаТабличнойЧасти.СтароеЗначение = ПараметрыУчетаОС.СпособНачисленияАмортизации;
	ИначеЕсли СтрокаТабличнойЧасти.Параметр = ПредопределенноеЗначение("Перечисление.ПараметрыМодернизацииОС.ГруппаНУ") Тогда
		СтрокаТабличнойЧасти.СтароеЗначение = ПараметрыУчетаОС.ГруппаНУ;
	ИначеЕсли СтрокаТабличнойЧасти.Параметр = ПредопределенноеЗначение("Перечисление.ПараметрыМодернизацииОС.Консервация") Тогда
		СтрокаТабличнойЧасти.СтароеЗначение = ПараметрыУчетаОС.Консервация;		
	ИначеЕсли СтрокаТабличнойЧасти.Параметр = ПредопределенноеЗначение("Перечисление.ПараметрыМодернизацииОС.ОбъемПродукции") Тогда
		СтрокаТабличнойЧасти.СтароеЗначение = ПараметрыУчетаОС.ОбъемПродукции;   
	ИначеЕсли СтрокаТабличнойЧасти.Параметр = ПредопределенноеЗначение("Перечисление.ПараметрыМодернизацииОС.ПараметрыВыработки") Тогда
		СтрокаТабличнойЧасти.СтароеЗначение = ПараметрыУчетаОС.ПараметрыВыработки;
	ИначеЕсли СтрокаТабличнойЧасти.Параметр = ПредопределенноеЗначение("Перечисление.ПараметрыМодернизацииОС.КоэффициентУскорения") Тогда
		СтрокаТабличнойЧасти.СтароеЗначение = ПараметрыУчетаОС.КоэффициентУскорения;			
	КонецЕсли;
	
	СтрокаТабличнойЧасти.Значение = СтрокаТабличнойЧасти.СтароеЗначение;

КонецПроцедуры // ЗаполнитьСтароеЗначение()

// Процедура - Расчет амортизации
//
&НаСервере
Процедура РасчетАмортизацииИОстаточнойСтоимости()
	Объект.АмортизацияЗаМесяц = 0;   
	
	// Выбираем последний документ изменения параметров расчета.
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СобытияОССрезПоследних.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ ВременнаяТаблицаСобытияОС
		|ИЗ
		|	РегистрСведений.СобытияОС.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И ОсновноеСредство = &ОсновноеСредство
		|				И Событие В (&ВидыСобытийОС)
		|				И Регистратор <> &Ссылка) КАК СобытияОССрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПараметрыУчетаОССрезПоследних.Период КАК Период,
		|	ПараметрыУчетаОССрезПоследних.СчетУчета.ПарныйСчет КАК ПарныйСчетУчета,
		|	ПараметрыУчетаОССрезПоследних.СтоимостьДляРасчетаАмортизации КАК БазаАмортизации
		|ИЗ
		|	РегистрСведений.ПараметрыУчетаОС.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И ОсновноеСредство = &ОсновноеСредство
		|				И Регистратор В
		|					(ВЫБРАТЬ
		|						ВременнаяТаблицаСобытияОС.Регистратор КАК Регистратор
		|					ИЗ
		|						ВременнаяТаблицаСобытияОС КАК ВременнаяТаблицаСобытияОС)) КАК ПараметрыУчетаОССрезПоследних";
	Запрос.УстановитьПараметр("Период", ДатаДокумента);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("ОсновноеСредство", Объект.ОсновноеСредство);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	ВидыСобытийОС = Новый СписокЗначений;
	ВидыСобытийОС.Добавить(Перечисления.ВидыСобытийОС.ПринятиеКУчету);
	ВидыСобытийОС.Добавить(Перечисления.ВидыСобытийОС.Модернизация);
	ВидыСобытийОС.Добавить(Перечисления.ВидыСобытийОС.ИзменениеПараметров);
	ВидыСобытийОС.Добавить(Перечисления.ВидыСобытийОС.Прочее);
	Запрос.УстановитьПараметр("ВидыСобытийОС", ВидыСобытийОС);	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Отказ = Ложь;
	
	Если Выборка.Следующий() Тогда
		Объект.БазаАмортизации = Выборка.БазаАмортизации;
		ДатаПринятияОС = Выборка.Период;
		
		Запрос = Новый Запрос();
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ХозрасчетныйОстатки.СуммаОстатокКт КАК Сумма
			|ИЗ
			|	РегистрБухгалтерии.Хозрасчетный.Остатки(
			|			&КонецПериода,
			|			Счет = &Счет,
			|			,
			|			Организация = &Организация
			|				И Субконто1 = &ОсновноеСредство) КАК ХозрасчетныйОстатки";
			
			
			
		Запрос.УстановитьПараметр("КонецПериода", ДатаДокумента);
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		Запрос.УстановитьПараметр("ОсновноеСредство", Объект.ОсновноеСредство);
		Запрос.УстановитьПараметр("Счет", Выборка.ПарныйСчетУчета);
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
				
		ВыборкаОстатки = РезультатЗапроса.Выбрать();
		
		Если ВыборкаОстатки.Следующий() Тогда
			Объект.НакопленнаяАмортизация = ВыборкаОстатки.Сумма;
		КонецЕсли;
		
	Иначе
		ТекстСообщения = НСтр("ru = 'Выбранное основное средство не принято к учету. Расчет отменен.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, "Объект.ОсновноеСредство",,Отказ);
	КонецЕсли;	
	
	Если Отказ Тогда
		Возврат;	
	КонецЕсли;			
	
	Объект.АмортизацияЗаМесяц = УправлениеВнеоборотнымиАктивамиВызовСервера.РасчетАмортизацииОсновногоСредства(Макс(НачалоМесяца(ДатаДокумента), НачалоДня(ДатаПринятияОС)), 
									КонецДня(ДатаДокумента), Объект.Организация, Объект.ОсновноеСредство, 
									ДанныеУчетнойПолитики.НачислениеАмортизацииОСПоМесяцам);
									
	АмортизацияЗаМесяцПослеМодернизации = УправлениеВнеоборотнымиАктивамиВызовСервера.РасчетАмортизацииОсновногоСредства(Макс(НачалоМесяца(ДатаДокумента), НачалоДня(ДатаПринятияОС)), 
									КонецДня(ДатаДокумента), Объект.Организация, Объект.ОсновноеСредство, 
									ДанныеУчетнойПолитики.НачислениеАмортизацииОСПоМесяцам, Объект.СтоимостьМодернизации);									
									
	ЛиквидационнаяСтоимость = ЗначениеЛиквидационнойСтоимости();
	Объект.ОстаточнаяСтоимостьОС = ПервоначальнаяСтоимость - Объект.НакопленнаяАмортизация;
	Если ДанныеУчетнойПолитики.НачислениеАмортизацииОСПоМесяцам Тогда
		Объект.НакопленнаяАмортизацияПослеМодернизации 	= Объект.НакопленнаяАмортизация + ?(Объект.НеВключатьАмортизациюЗаМесяц, 0, Объект.АмортизацияЗаМесяц);
		Объект.ОстаточнаяСтоимостьОСПослеМодернизации 	= ПервоначальнаяСтоимость + Объект.СтоимостьМодернизации - Объект.НакопленнаяАмортизацияПослеМодернизации; 
		Объект.АмортизацияЗаМесяцПослеМодернизации 		= Объект.АмортизацияЗаМесяц;
	Иначе	
		Объект.НакопленнаяАмортизацияПослеМодернизации 	= Объект.НакопленнаяАмортизация + ?(Объект.НеВключатьАмортизациюЗаМесяц, 0, Объект.АмортизацияЗаМесяц);
		Объект.ОстаточнаяСтоимостьОСПослеМодернизации 	= ПервоначальнаяСтоимость + Объект.СтоимостьМодернизации - Объект.НакопленнаяАмортизацияПослеМодернизации;
		Объект.АмортизацияЗаМесяцПослеМодернизации 		= АмортизацияЗаМесяцПослеМодернизации;		
	КонецЕсли;	
			
	Объект.БазаАмортизацииПослеМодернизации = ?(ВычетНАПриМодернизации,
		ПервоначальнаяСтоимость + Объект.СтоимостьМодернизации - ЛиквидационнаяСтоимость - Объект.НакопленнаяАмортизацияПослеМодернизации,
		ПервоначальнаяСтоимость + Объект.СтоимостьМодернизации - ЛиквидационнаяСтоимость);	
	
КонецПроцедуры // РасчетАмортизацииИОстаточнойСтоимости()

&НаКлиенте
Процедура РасчетЛиквидационнойСтоимости(СтрокаТабличнойЧасти)
	Если СтрокаТабличнойЧасти.Параметр = ПредопределенноеЗначение("Перечисление.ПараметрыМодернизацииОС.ЛиквидационнаяСтоимость") Тогда
	  СтрокаТабличнойЧасти.Значение = (Объект.СтоимостьМодернизации + ПервоначальнаяСтоимость) / 100;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЗначениеЛиквидационнойСтоимости()
	ЛиквидационнаяСтоимость = 0;
	ПараметрыОтбора = Новый Структура("Параметр", Перечисления.ПараметрыМодернизацииОС.ЛиквидационнаяСтоимость);
	Массив = Объект.ПараметрыОС.НайтиСтроки(ПараметрыОтбора);
	
	Если Массив.Количество() > 0 Тогда
	 	ЛиквидационнаяСтоимость = Массив[0].Значение;
	КонецЕсли;	
	
	Возврат ЛиквидационнаяСтоимость;
КонецФункции // ()

&НаСервере
Процедура ПодставитьСчетУчетаМодернизации(Счет)

	Если Счет.Родитель = ПланыСчетов.Хозрасчетный.ОсновныеСредства Тогда
		Объект.СчетУчетаМодернизации = ПланыСчетов.Хозрасчетный.МодернизацияОС;
	Иначе
		Объект.СчетУчетаМодернизации = ПланыСчетов.Хозрасчетный.МодернизацияНМА;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПараметрыВыбораПараметраОС()
	Элементы.ПараметрыПараметр.СписокВыбора.Очистить();
	
	Элементы.ПараметрыПараметр.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ПараметрыМодернизацииОС.СрокСлужбы"));
	Элементы.ПараметрыПараметр.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ПараметрыМодернизацииОС.ИнвентарныйНомер"));
	Элементы.ПараметрыПараметр.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ПараметрыМодернизацииОС.СпособОтраженияРасходовПоАмортизации"));
	Элементы.ПараметрыПараметр.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ПараметрыМодернизацииОС.СчетУчета"));
	Элементы.ПараметрыПараметр.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ПараметрыМодернизацииОС.ЛиквидационнаяСтоимость"));
	Элементы.ПараметрыПараметр.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ПараметрыМодернизацииОС.СпособНачисленияАмортизации"));
	Элементы.ПараметрыПараметр.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ПараметрыМодернизацииОС.ГруппаНУ"));
	Элементы.ПараметрыПараметр.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ПараметрыМодернизацииОС.ПараметрыВыработки"));
	Элементы.ПараметрыПараметр.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ПараметрыМодернизацииОС.ОбъемПродукции"));
	Элементы.ПараметрыПараметр.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ПараметрыМодернизацииОС.КоэффициентУскорения"));
	Если Объект.Событие = ПредопределенноеЗначение("Перечисление.ВидыСобытийОС.ИзменениеПараметров") Тогда
	 	Элементы.ПараметрыПараметр.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ПараметрыМодернизацииОС.Консервация"));
	КонецЕсли;		

КонецПроцедуры // УстановитьТипПоляСтрокиТабличнойЧасти()

#КонецОбласти

#Область ОбработчикиБиблиотек

// СтандартныеПодсистемы.ПодключаемыеКоманды

//@skip-warning
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
     ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
     ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры
 
&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
     ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

//@skip-warning
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
     ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
